models/LoginForm.php

    public function login()
    {
        if ($this->validate()) {

            $user =  $this->getUser();

            if($user['status'] != 10 ){
                parent::clearErrors();
                parent::addError('password','用户不存在');
                return false;
            }

            User::updateAll(['updated_at' => time()],['username' => $this->username]);
---
UPDATE `dy_user` SET `updated_at`=1482482345 WHERE `username`='admin'